Repository: GurJack/CommonUtils
Catalog: CommonUtilsTest/CommonWPFTest/Resources/Common.*.resx
Languages: ru

source: Access denied.
ru: Доступ запрещён.

# AccessDeniedToCreate
source: You have not permissions to create <{0}>.
ru: У вас нет прав на создание: <{0}>.

# AccessDeniedToDelete
source: You have not permissions to delete <{0}>.
ru: У вас нет прав на удаление: <{0}>.

# AccessDeniedToRead
source: You have not permissions to read <{0}>.
ru: У вас нет прав на чтение: <{0}>.

# AccessDeniedToReport
source: You have not permissions to report
ru: У вас нет прав на формирование отчёта

# AccessDeniedToUpdate
source: You have not permissions to update <{0}>.
ru: У вас нет прав на изменение: <{0}>.

# Action_Table
source: Table
ru: Таблица

# AddFromObject
source: Add object copy
ru: Добавить копию объекта

source: Additional filter
ru: Расширенный поиск

# AddObject
source: Add
ru: Добавить

# AddressToAdministrator
source: Address to your system administrator.
ru: Обратитесь к вашему системному администратору.

# ApplicationExit
source: Exit
ru: Выход

source: Attention
ru: Внимание

source: Cancel
ru: Отмена

# CannotChangeEnumConst
source: Cannot change a constant declared in the code
ru: Нельзя изменять имя константы, которая задекларирована в коде

# CannotRemoveEnumConst
source: Cannot remove a constant declared in the code
ru: Нельзя удалять константу, которая задекларирована в коде

# ChangeLinkObject
source: Edit reference object
ru: Изменить объект по ссылке

# ChangeObject
source: Change
ru: Редактировать

# ClassNotFound
source: Class <{0}> is not found.
ru: Класс <{0}> не найден.

# ClearAllText
source: Clear All
ru: Очистить все

# CommonConfigs
source: Common settings
ru: Общие настройки

# CompressionProviderNotFound
source: Compression provider for the <{0}> path is not found.
ru: Провайдер для сжатия для <{0}> пути не найден.

# ConfigProviderNotFound
source: Config provider for the <{0}> path is not found.
ru: Конфигурационный провайдер для <{0}> пути не найден.

source: Connection
ru: Соединение

source: Connection choice
ru: Выбор соединения

# ConnectionManager
source: Connections manager
ru: Редактор соединений

source: Connection string
ru: Строка соединения

# CopyText
source: Copy
ru: Копировать

source: Creating
ru: Создание

# CryptoProviderNotFound
source: Crypto provider for the <{0}> path is not found.
ru: Провайдер для шифрования для <{0}> пути не найден.

# CutText
source: Cut
ru: Вырезать

source: Data access denied.
ru: Доступ к данным запрещен.

# DeleteText
source: Delete
ru: Очистить

# DialectProviderLibrary
source: SQL dialect provider assembly
ru: Сборка провайдера SQL-диалекта

# DialectProviderType
source: SQL dialect provider type
ru: Тип провайдера SQL-диалекта

# EditorCustomization
source: Object editing
ru: Редактирование объектов

source: Empty
ru: Пусто

# ErrorWritingParameter
source: Error writing users parameter <{0}>.
ru: Ошибка записи параметра пользователя <{0}>.

# FileProviderNotFound
source: File provider for the <{0}> path is not found.
ru: Файловый провайдер для <{0}> пути не найден.

source: Find
ru: Найти

source: From
ru: От

source: Hide filter panel
ru: Скрыть панель фильтра

source: Icon name
ru: Название иконки

# IconSmallName
source: Small icon name
ru: Название мини иконки

# ImpossibleRemoveInheritedAttribute
source: It was not possible to remove inherited attribute <{0}>.
ru: Невозможно удалить наследуемый атрибут <{0}>.

# ImpossibleRemoveSystemObject
source: It was not possible to remove system object <{0}>.
ru: Невозможно удалить системный объект <{0}>.

source: Interface
ru: Интерфейс

# InvalidAttributeValue
source: <{0}> value is not valid.
ru: Поле <{0}> содержит некорректное значение.

# InvalidConfigPath
source: Config path <{0}> is not valid.
ru: Конфигурационный путь <{0}> имеет неверный формат.

# InvalidLoginOrPassword
source: Login name <{0}> or password is not valid.
ru: Неправильное имя входа <{0}> или пароль.

# InvalidObject
source: <{0}> is not valid.
ru: <{0}> содержит некорректные значения полей.

# InvalidXmlConfigFile
source: Config file <{0}> is not valid XML document.
ru: Файл конфигурации <{0}> имеет неверный XML формат.

# KeyAlreadyExists
source: Value with this key already exists.
ru: Значение с таким ключем уже существует.

source: Listening...
ru: Слушаю...

# LoggedAs
source: Logged as {0}
ru: Текущий пользователь: {0}

source: Login
ru: Вход

source: Login name:
ru: Пользователь:

# LoginType
source: Authorization type
ru: Тип авторизации

source: Logo name
ru: Название логотипа

# MainApplicationSystemMenu
source: System
ru: Служебное

source: Name
ru: Наименование

# ObjectEditorDialog_CloseWithoutSaving
source: Are you sure you want to close this window? All unsaved changes are going to be lost.
ru: Вы уверены, что хотите закрыть окно? Все несохраненные изменения будут потеряны.

# ObjectEditorFrame_GeneralTabPageName
source: General
ru: Общие

# ObjectNotFound
source: Object <{0}> is not found.
ru: Объект <{0}> не найден.

# ObjectReadOnly
source: Object <{0}> is read-only.
ru: Объект <{0}> - только для чтения.

source: Objects
ru: Объекты

source: OK
ru: ОК

# ParameterNotFound
source: Parameter <{0}> is not found.
ru: Параметр <{0}> не найден.

source: Password:
ru: Пароль:

# PasteText
source: Paste
ru: Вставить

# PersistentCustomizationDialog
source: Customization of the user interface
ru: Кастомизация интерфейса пользователя

source: Press [Enter] to apply filter.
ru: Нажмите клавишу [Enter], чтобы применить фильтр.

source: Preview
ru: Просмотр

# ProviderLibrary
source: Provider assembly
ru: Сборка провайдера

source: Provider type
ru: Тип провайдера

# RefreshData
source: Refresh
ru: Обновить

source: Clear filter
ru: Очистить фильтр

# RemoveObject
source: Remove
ru: Удалить

# RemoveSelectedObjects
source: Do you want to remove all selected objects ({0})?
ru: Удалить все выделенные объекты ({0})?

source: Report
ru: Отчёт

source: Reports
ru: Отчёты

# ResetUserConfigs
source: Do you want to reset the user configuration?
ru: Сбросить настройки пользователя?

# ResetUserConfigsLabel
source: Resets the user configuration
ru: Сбросить настройки пользователя

# RowCount
source: Rows count
ru: Число строк

source: Select all
ru: Выделить все

# SelectAllText
source: Select All
ru: Выделить все

# SelectObject
source: Select
ru: Выбрать

# ServerName
source: Connection
ru: Соединение

# SetCurrentDatePeriodic
source: Set Current Date
ru: Текущий период

# SetCurrentDateTime
source: Set Current Date
ru: Сегодня

# ShowColumnChooser
source: Show columns...
ru: Показать колонки...

source: Show filter panel
ru: Показать панель фильтра

# SSAcceptCheck
source: Accept check
ru: Завершить чек

# SSAddGood
source: Add good
ru: Добавить товар

# SSChequeCaption
source: Cheque № {0}
ru: Товарный чек № {0}

# SSClearList
source: Clear list
ru: Очистить список

# SSDelayCheck
source: Delay check
ru: Отложить чек

# SSDeleteGood
source: Remove good
ru: Удалить товар

# SSFinishActions
source: Finishing actions
ru: Действия

# SSGroupGoods
source: Goods manipulation
ru: Товары

# SystemConfigDialog
source: System settings
ru: Системные настройки

# SystemConfigs
source: System settings
ru: Системные настройки

# TableCustomization
source: Object list
ru: Список объектов

source: To
ru: До

# UndoText
source: Undo
ru: Отменить

source: Updating
ru: Редактирование

source: Use
ru: Использовать

# ValueChanged
source: Value is changed
ru: Значение изменено

# ValueNotValid
source: Value is not valid
ru: Значение некорректно

# VisualType
source: Interface type frame
ru: Тип интерфейса

source: Clear visual customization
ru: Сбросить визуализацию

source: Visual customization
ru: Настройки интерфейса

# AddObjectFromList
source: Add objects from the list
ru: Добавить объекты из списка

# RemoveObjectFromList
source: Exclude objects from the list
ru: Исключить объекты из списка

# ScanAskMemory
source: Download scanner memory
ru: Получить данные

# ScanClearMemory
source: Clear scanner memory
ru: Очистить память

# ScanReportIn
source: Codes to enter offline
ru: Коды для входа

# ScanReportOut
source: Codes to exit offline
ru: Коды для выхода

# ScanToInventory
source: Offline scanner mode
ru: Автономный режим

source: All
ru: Все

source: No
ru: Нет

source: Yes
ru: Да

# AccessDeniedToWorkFlowStage
source: You have not permissions to execute workflow stage <{0}>.
ru: У вас нет прав на выполнение операции: <{0}>.

# ExecuteAccessDenied
source: Operation access denied.
ru: Доступ к выполнению операции запрещен.

# WorkFlowIncorrectStage
source: Incorrect stage <{0}> for object <{1}>. Initial state according stage: <{2}>. Current state of object: <{3}>.
ru: Некорректный этап движения документа <{0}> для объекта <{1}>. Исходный статус согласно этапу движения: <{2}>. Текущий статус объекта: <{3}>.

# ScannerInteraction
source: Interaction with the scanner
ru: Взаимодействие со сканером

source: Workflow
ru: Движение документа

# ClassHasNotAttribute
source: Class <{0}> has not attribute <{1}>.
ru: Класс <{0}> не имеет атрибут <{1}>.

# AttributeReadOnly
source: Attribute <{0}> of <{1}> is read-only.
ru: Атрибут <{0}> класса <{1}> - только для чтения.

# ConstraintLetterOrDigit
source: <{0}> must contains only letter or digit.
ru: Поле <{0}> должно содержать только буквы или цифры.

# ConstraintStartLetter
source: <{0}> must starts with letter.
ru: Поле <{0}> должно начинаться с буквы.

# InvalidExpression
source: <{0}> contains invalid expression.
ru: Поле <{0}> содержит некорректное выражение.

# LoadingData
source: Loading data... Please wait.
ru: Загрузка данных... Пожалуйста, подождите.

# CannotChangeEnumProcessStage
source: Cannot change a process stage declared in the code
ru: Нельзя изменять код этапа движения документа/процесса, который задекларирован в коде

# CannotRemoveEnumProcessStage
source: Cannot remove a process stage declared in the code
ru: Нельзя удалять этап движения документа/процесса, который задекларирован в коде

# TradeEquipmentConfigs
source: Trade equipment settings
ru: Настройки торгового оборудования

source: Close
ru: Закрыть

source: Save and close
ru: Сохранить и закрыть

# ImageProviderNotFound
source: Image provider for the <{0}> path is not found.
ru: Провайдер изображений для <{0}> пути не найден.

# DeviceConfigs
source: Device settings
ru: Настройка устройств

source: Metadata storage
ru: Хранилище метаданных

# WorkFlowConditionIsNotSatisfied
source: Condition for stage <{0}> is not satisfied.
ru: Не выполнены условия для перехода документа в состояние <{0}>.

# TemplateVerificationGoodRow
source: <tr> <td width="100" valign="top" align="left"> <img src="{7}" alt="" title="{0}"/> </td> <td style="padding-left:20px; padding-top:20px;"> <b style="text-transform:uppercase; font-size:12pt; font-family:arial">{1} {2}</b><br /> <span style="line-height:20px;color:#8f8f8f; font-size:11pt;font-family:arial">Article: {3}</span><br /> <span style="line-height:20px;color:#8f8f8f; font-size:11pt;font-family:arial">Color: {4}</span><br /> <span style="line-height:20px;color:#8f8f8f; font-size:11pt;font-family:arial">Size: {5}</span><br /> <span style="line-height:20px;color:#8f8f8f; font-size:11pt;font-family:arial">Material: {6}</span> </td> </tr>
ru: <tr> <td width="100" valign="top" align="left"> <img src="{8}" alt="Нет фото" title="{0}"/> </td> <td style="padding-left:20px; padding-top:20px;"> <b style="text-transform:uppercase; font-size:12pt; font-family:arial">{1} {2}</b> <br /> <span style="line-height:20px;color:#8f8f8f; font-size:11pt;font-family:arial">Артикул: {3} </span> <br /> <span style="line-height:20px;color:#8f8f8f; font-size:11pt;font-family:arial">Код материала: {4} </span> <br /> <span style="line-height:20px;color:#8f8f8f; font-size:11pt;font-family:arial">Материал: {5} </span> <br /> <span style="line-height:20px;color:#8f8f8f; font-size:11pt;font-family:arial">Цвет: {6} </span> <br /> <span style="line-height:20px;color:#8f8f8f; font-size:11pt;font-family:arial">Размер: {7} </span> <br /> </td> </tr>

# ConstraintHierarchy
source: <{0}> must be not current object or it's descendant.
ru: Поле <{0}> не должно быть текущим объектом или его потомком.

# UserTokenIsNull
source: User permission error. <{0}> is not specified for user <{1}>.
ru: Ошибка прав пользователя. <{1}> не указан для пользователя <{0}>.

# AccountLocked
source: Account <{0}> is locked.
ru: Пользователь <{0}> заблокирован.

# SelectClassDialog
source: Object Type Selection
ru: Выбор типа объекта

# SelectClassGroupBox
source: Select object type:
ru: Выберите тип объекта:

# ConstraintLetterOrDigitOrUnderscore
source: <{0}> must contains only letter, digit or underline.
ru: Поле <{0}> должно содержать только буквы, цифры или знак подчёркивания.

# UrlToCheckConnection
source: Check connection (URL)
ru: Проверка соединения (URL)

# IncompatibleTypes
source: Incompatible types: from <{0}> to <{1}>.
ru: Несовместимые типы: из <{0}> в <{1}>.

# CannotBeEmpty
source: <{0}> must be not empty.
ru: Поле <{0}> не должно быть пустым.

# ConstraintLetterOrDigitOrUnderscoreOrDot
source: <{0}> must contains only letter, digit, underline or dot.
ru: Поле <{0}> должно содержать только буквы, цифры, знак подчёркивания или точку.

source: Load from Excel
ru: Загрузить из Excel

source: Help
ru: Помощь

# CopyObject
source: Copy object to clipboard
ru: Копировать объект в буфер

# PasteObject
source: Paste object from clipboard
ru: Вставить объект из буфера

# MultipleEditing
source: Multiple objects editing
ru: Изменение нескольких объектов
